AEyeSecurity/ESP32_SALUS/src/pi_comms.cpp
const char* statusSourceText(uint8_t sourceCode) {
  switch (sourceCode) {
    case 1:
      return "PI";
    case 2:
      return "RC";
    case 3:
      return "TEL";
    case 0:
    default:
      return "NONE";
  }
}

String describeStatusFlags(uint8_t status) {
  String flags;
  flags.reserve(64);
  appendFlag(flags, (status & kStatusReady) != 0, "READY");
  appendFlag(flags, (status & kStatusEstopActive) != 0, "ESTOP");
  appendFlag(flags, (status & kStatusFailsafeActive) != 0, "FAILSAFE");
  appendFlag(flags, (status & kStatusPiFresh) != 0, "PI_FRESH");
  appendFlag(flags, (status & kStatusOverspeedActive) != 0, "OVERSPEED");

  const uint8_t sourceCode = static_cast<uint8_t>((status & kStatusControlSourceMask) >> kStatusControlSourceShift);

  String msg;
  msg.reserve(96);
  msg += "status=0x";
  msg += String(status, HEX);
  msg += " (";
  msg += (flags.length() > 0) ? flags : "none";
  msg += " src=";
  msg += statusSourceText(sourceCode);
  msg += ")";
  return msg;
}

String describeSpeedTelemetry(uint16_t speedCentiMps) {
  if (speedCentiMps == kSpeedTelemetryNotAvailable) {
    return "N/A";
  }
  String msg = String(static_cast<float>(speedCentiMps) / 100.0f, 2);
  msg += "m/s";
  return msg;
}

String describeSteerTelemetry(int16_t steerCentiDeg) {
  if (steerCentiDeg == kSteerTelemetryNotAvailable) {
    return "N/A";
  }
  String msg = String(static_cast<float>(steerCentiDeg) / 100.0f, 2);
  msg += "deg";
  return msg;
}

String describeBatteryFlags(uint8_t flags) {
  String msg;
  appendFlag(msg, (flags & kBatteryStatusReady) != 0, "READY");
  appendFlag(msg, (flags & kBatteryStatusFresh) != 0, "FRESH");
  appendFlag(msg, (flags & kBatteryStatusSuspect) != 0, "SUSPECT");
  appendFlag(msg, (flags & kBatteryStatusCalibrated) != 0, "CAL");

  String out;
  out.reserve(64);
  out += "flags=0x";
  out += String(flags, HEX);
  out += " (";
  out += (msg.length() > 0) ? msg : "none";
  out += ")";
  return out;
}

uint8_t encodeBatteryFlags(const BatterySnapshot& snapshot, TickType_t nowTick, TickType_t samplePeriod) {
  uint8_t flags = 0;
  if (snapshot.driverReady && snapshot.sampleCount > 0) {
    flags |= kBatteryStatusReady;
  }

  if (snapshot.driverReady) {
    flags |= kBatteryStatusCalibrated;
  }

  if (snapshot.sampleCount > 0) {
    TickType_t freshnessWindow = samplePeriod;
    if (freshnessWindow == 0) {
      freshnessWindow = pdMS_TO_TICKS(5000);
    }
    freshnessWindow *= kBatteryFreshFactor;
    const TickType_t ageTicks = nowTick - snapshot.sampleTick;
    if (ageTicks <= freshnessWindow) {
      flags |= kBatteryStatusFresh;
    }
  }

  if (snapshot.adcPinMv >= kBatterySuspectAdcThresholdMv || snapshot.batteryMv == 0u) {
    flags |= kBatteryStatusSuspect;
  }

  return flags;
}

uint8_t encodeBatterySampleAgeDs(const BatterySnapshot& snapshot, TickType_t nowTick) {
  if (snapshot.sampleCount == 0) {
    return std::numeric_limits<uint8_t>::max();
  }
  const TickType_t ageTicks = nowTick - snapshot.sampleTick;
  const uint32_t ageMs = static_cast<uint32_t>(ageTicks * portTICK_PERIOD_MS);
  return clampToU8((ageMs + 50u) / 100u);
}

uint16_t encodeSpeedTelemetryFromHall(const HallSpeedSnapshot& speed, bool snapshotOk) {
  if (!snapshotOk || !speed.driverReady || !isfinite(speed.speedMps)) {
    return kSpeedTelemetryNotAvailable;
  }

  const float speedMps = fabsf(speed.speedMps);

  long speedCenti = lroundf(speedMps * 100.0f);
  if (speedCenti < 0) {
    speedCenti = 0;
  } else if (speedCenti > 65534L) {
    speedCenti = 65534L;
  }
  return static_cast<uint16_t>(speedCenti);
}

void recordHallTelemetryCapture(const HallSpeedSnapshot& hall,
                                bool hallSnapshotOk,
                                uint32_t txSequence,
                                uint32_t txTimestampUs,
                                uint16_t speedCentiMps) {
  PiHallTelemetryCaptureRecord record{};
  record.sequence = txSequence;
  record.txTimestampUs = txTimestampUs;
  record.speedCentiMps = speedCentiMps;
  if (hallSnapshotOk) {
    record.transitionPeriodUs = hall.transitionPeriodUs;
    record.lastTransitionUs = hall.lastTransitionUs;
    record.eventAgeUs = (hall.lastTransitionUs != 0U) ? txTimestampUs - hall.lastTransitionUs : 0U;
    record.transitionsOk = hall.transitionsOk;
    record.transitionsInvalidState = hall.transitionsInvalidState;
    record.transitionsInvalidJump = hall.transitionsInvalidJump;
    record.isrCount = hall.isrCount;
    record.hallMask = hall.hallMask;
    record.flags |= kHallCaptureFlagSnapshotOk;
    if (hall.hasTransition) {
      record.flags |= kHallCaptureFlagHasTransition;
    }
  }

  portENTER_CRITICAL(&g_hallCaptureMux);
  if (!g_hallCaptureState.armed || g_hallCaptureState.frozen) {
    portEXIT_CRITICAL(&g_hallCaptureMux);
    return;
  }

  g_hallCaptureRecords[g_hallCaptureState.writeIndex] = record;
  g_hallCaptureState.writeIndex =
      static_cast<uint16_t>((g_hallCaptureState.writeIndex + 1U) % kHallCaptureCapacity);
  if (g_hallCaptureState.count < kHallCaptureCapacity) {
    g_hallCaptureState.count++;
  }

  if (!g_hallCaptureState.triggered && speedCentiMps != kSpeedTelemetryNotAvailable &&
      speedCentiMps >= kHallCaptureTriggerCentiMps) {
    g_hallCaptureState.triggered = true;
    g_hallCaptureState.triggerSequence = txSequence;
    g_hallCaptureState.triggerSpeedCentiMps = speedCentiMps;
    g_hallCaptureState.postTriggerRemaining = kHallCapturePostTriggerSamples;
  } else if (g_hallCaptureState.triggered && g_hallCaptureState.postTriggerRemaining > 0U) {
    g_hallCaptureState.postTriggerRemaining--;
    if (g_hallCaptureState.postTriggerRemaining == 0U) {
      g_hallCaptureState.frozen = true;
      g_hallCaptureState.armed = false;
    }
  }
  portEXIT_CRITICAL(&g_hallCaptureMux);
}

void logHallTelemetryTrace(const HallSpeedSnapshot& hall,
                           bool hallSnapshotOk,
                           uint32_t txSequence,
                           uint32_t txTimestampUs,
                           uint16_t speedCentiMps) {
  if (!piCommsGetHallTelemetryTraceEnabled()) {
    return;
  }

  const uint32_t transitionAgeUs =
      (hallSnapshotOk && hall.lastTransitionUs != 0U) ? txTimestampUs - hall.lastTransitionUs : 0U;
  String msg;
  msg.reserve(224);
  msg += "[PI][HALLTRACE] seq=";
  msg += txSequence;
  msg += " txUs=";
  msg += txTimestampUs;
  msg += " speedCenti=";
  msg += speedCentiMps;
  msg += " periodUs=";
  msg += (hallSnapshotOk ? hall.transitionPeriodUs : 0U);
  msg += " lastTransitionUs=";
  msg += (hallSnapshotOk ? hall.lastTransitionUs : 0U);
  msg += " eventAgeUs=";
  msg += transitionAgeUs;
  msg += " hall=0b";
  msg += (hallSnapshotOk && (hall.hallMask & (1U << 2))) ? '1' : '0';
  msg += (hallSnapshotOk && (hall.hallMask & (1U << 1))) ? '1' : '0';
  msg += (hallSnapshotOk && (hall.hallMask & (1U << 0))) ? '1' : '0';
  msg += " hasTransition=";
  msg += (hallSnapshotOk && hall.hasTransition) ? "Y" : "N";
  msg += " ok=";
  msg += (hallSnapshotOk ? hall.transitionsOk : 0U);
  msg += " invState=";
  msg += (hallSnapshotOk ? hall.transitionsInvalidState : 0U);
  msg += " invJump=";
  msg += (hallSnapshotOk ? hall.transitionsInvalidJump : 0U);
  msg += " isr=";
  msg += (hallSnapshotOk ? hall.isrCount : 0U);
  // HALLTRACE is a Telnet-only sideband; keep it off the Serial/control log path.
  // EnviarMensajeTelnet enqueues with zero wait so this 100 Hz TX task never blocks.
  EnviarMensajeTelnet(msg);
}

int16_t encodeSteerTelemetryCentered() {
  PidRuntimeSnapshot pidSnapshot{};
  if (!pidGetRuntimeSnapshot(pidSnapshot) || !pidSnapshot.valid || !pidSnapshot.sensorValid ||
      !isfinite(pidSnapshot.measuredDeg)) {
    return kSteerTelemetryNotAvailable;
  }

  const SteeringCalibrationData calibration = steeringCalibrationSnapshot();
  const float centerDeg = calibration.initialized ? calibration.adjustedCenterDeg : 0.0f;
  float centeredDeg = wrapAngleDegrees(pidSnapshot.measuredDeg - centerDeg);
  if (!isfinite(centeredDeg)) {
    return kSteerTelemetryNotAvailable;
  }

  if (centeredDeg < -180.0f) {
    centeredDeg = -180.0f;
  } else if (centeredDeg > 180.0f) {
    centeredDeg = 180.0f;
  }

  long centeredCenti = lroundf(centeredDeg * 100.0f);
  if (centeredCenti < -18000L) {
    centeredCenti = -18000L;
  } else if (centeredCenti > 18000L) {
    centeredCenti = 18000L;
  }
  return static_cast<int16_t>(centeredCenti);
}

uint8_t encodeDriveSource(QuadDriveControlSource source) {
  switch (source) {
    case QuadDriveControlSource::kPi:
      return 1;
    case QuadDriveControlSource::kRc:
      return 2;
    case QuadDriveControlSource::kTelnet:
      return 3;
    case QuadDriveControlSource::kNone:
    default:
      return 0;
  }
}

